results/fail.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: slo-test-fail.js
        output: -

     scenarios: (100.00%) 1 scenario, 20 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 20 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 20 VUs  01.0s/30s

running (0m02.0s), 20/20 VUs, 20 complete and 0 interrupted iterations
default   [   7% ] 20 VUs  02.0s/30s

running (0m03.0s), 20/20 VUs, 40 complete and 0 interrupted iterations
default   [  10% ] 20 VUs  03.0s/30s

running (0m04.0s), 20/20 VUs, 57 complete and 0 interrupted iterations
default   [  13% ] 20 VUs  04.0s/30s

running (0m05.0s), 20/20 VUs, 60 complete and 0 interrupted iterations
default   [  17% ] 20 VUs  05.0s/30s

running (0m06.0s), 20/20 VUs, 80 complete and 0 interrupted iterations
default   [  20% ] 20 VUs  06.0s/30s

running (0m07.0s), 20/20 VUs, 100 complete and 0 interrupted iterations
default   [  23% ] 20 VUs  07.0s/30s

running (0m08.0s), 20/20 VUs, 119 complete and 0 interrupted iterations
default   [  27% ] 20 VUs  08.0s/30s

running (0m09.0s), 20/20 VUs, 122 complete and 0 interrupted iterations
default   [  30% ] 20 VUs  09.0s/30s

running (0m10.0s), 20/20 VUs, 140 complete and 0 interrupted iterations
default   [  33% ] 20 VUs  10.0s/30s

running (0m11.0s), 20/20 VUs, 160 complete and 0 interrupted iterations
default   [  37% ] 20 VUs  11.0s/30s

running (0m12.0s), 20/20 VUs, 180 complete and 0 interrupted iterations
default   [  40% ] 20 VUs  12.0s/30s

running (0m13.0s), 20/20 VUs, 187 complete and 0 interrupted iterations
default   [  43% ] 20 VUs  13.0s/30s

running (0m14.0s), 20/20 VUs, 202 complete and 0 interrupted iterations
default   [  47% ] 20 VUs  14.0s/30s

running (0m15.0s), 20/20 VUs, 220 complete and 0 interrupted iterations
default   [  50% ] 20 VUs  15.0s/30s

running (0m16.0s), 20/20 VUs, 240 complete and 0 interrupted iterations
default   [  53% ] 20 VUs  16.0s/30s

running (0m17.0s), 20/20 VUs, 250 complete and 0 interrupted iterations
default   [  57% ] 20 VUs  17.0s/30s

running (0m18.0s), 20/20 VUs, 263 complete and 0 interrupted iterations
default   [  60% ] 20 VUs  18.0s/30s

running (0m19.0s), 20/20 VUs, 281 complete and 0 interrupted iterations
default   [  63% ] 20 VUs  19.0s/30s

running (0m20.0s), 20/20 VUs, 299 complete and 0 interrupted iterations
default   [  67% ] 20 VUs  20.0s/30s

running (0m21.0s), 20/20 VUs, 313 complete and 0 interrupted iterations
default   [  70% ] 20 VUs  21.0s/30s

running (0m22.0s), 20/20 VUs, 325 complete and 0 interrupted iterations
default   [  73% ] 20 VUs  22.0s/30s

running (0m23.0s), 20/20 VUs, 341 complete and 0 interrupted iterations
default   [  77% ] 20 VUs  23.0s/30s

running (0m24.0s), 20/20 VUs, 360 complete and 0 interrupted iterations
default   [  80% ] 20 VUs  24.0s/30s

running (0m25.0s), 20/20 VUs, 374 complete and 0 interrupted iterations
default   [  83% ] 20 VUs  25.0s/30s

running (0m26.0s), 20/20 VUs, 389 complete and 0 interrupted iterations
default   [  87% ] 20 VUs  26.0s/30s

running (0m27.0s), 20/20 VUs, 401 complete and 0 interrupted iterations
default   [  90% ] 20 VUs  27.0s/30s

running (0m28.0s), 20/20 VUs, 421 complete and 0 interrupted iterations
default   [  93% ] 20 VUs  28.0s/30s

running (0m29.0s), 20/20 VUs, 436 complete and 0 interrupted iterations
default   [  97% ] 20 VUs  29.0s/30s

running (0m30.0s), 20/20 VUs, 451 complete and 0 interrupted iterations
default   [ 100% ] 20 VUs  30.0s/30s

running (0m31.0s), 10/20 VUs, 461 complete and 0 interrupted iterations
default ↓ [ 100% ] 20 VUs  30s


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.90' rate=98.01%

    http_req_duration{name:cart}
    ✗ 'p(95)<1' p(95)=2.7ms

    http_req_duration{name:report}
    ✓ 'p(95)<450' p(95)=390.8ms

    http_req_failed{name:pay}
    ✓ 'rate<0.08' rate=5.94%


  █ TOTAL RESULTS 

    checks_total.......: 1413   45.058603/s
    checks_succeeded...: 98.01% 1385 out of 1413
    checks_failed......: 1.98%  28 out of 1413

    ✓ cart 200
    ✓ report 200
    ✗ pay 200
      ↳  94% — ✓ 443 / ✗ 28

    HTTP
    http_req_duration..............: avg=101.11ms min=300.44µs med=1.55ms   max=400.64ms p(90)=336.3ms  p(95)=367.91ms
      { expected_response:true }...: avg=103.13ms min=300.44µs med=1.58ms   max=400.64ms p(90)=339.32ms p(95)=368.63ms
      { name:cart }................: avg=1.69ms   min=312.66µs med=1.35ms   max=14.16ms  p(90)=2.2ms    p(95)=2.7ms   
      { name:report }..............: avg=300.57ms min=201.04ms med=299.99ms max=400.64ms p(90)=379.76ms p(95)=390.8ms 
    http_req_failed................: 1.98%  28 out of 1413
      { name:pay }.................: 5.94%  28 out of 471
    http_reqs......................: 1413   45.058603/s

    EXECUTION
    iteration_duration.............: avg=1.3s     min=1.2s     med=1.3s     max=1.4s     p(90)=1.38s    p(95)=1.39s   
    iterations.....................: 471    15.019534/s
    vus............................: 10     min=10         max=20
    vus_max........................: 20     min=20         max=20

    NETWORK
    data_received..................: 355 kB 11 kB/s
    data_sent......................: 126 kB 4.0 kB/s



running (0m31.4s), 00/20 VUs, 471 complete and 0 interrupted iterations
default ✓ [ 100% ] 20 VUs  30s
time="2026-09-22T13:39:43-04:00" level=error msg="thresholds on metrics 'http_req_duration{name:cart}' have been crossed"
K6 EXIT CODE: 99